rs-online2/app/controllers/packages_controller.rb

  def index
    @packages = Package.all
---
SELECT * FROM "packages"

  def show
    @package = Package.find(params[:id])
---
SELECT * FROM "packages" WHERE ("packages"."id" = 1)

  def edit
    @package = Package.find(params[:id])
---
SELECT * FROM "packages" WHERE ("packages"."id" = 1)

  def create
    @package = Package.new(params[:package])

    respond_to do |format|
      if @package.save
        # apos salvar o pacote é necessário salvar todos os links
        a_links = @package.links.to_a
        a_links.each do |row|
          Link.create( :url => row.chomp, :package_id => @package.id )
---
INSERT INTO "packages" ("description", "comment", "completed", "show", "problem", "date_created", "date_started", "date_finished", "password", "priority_id", "source", "legend") VALUES('lost.s01.e03', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '', 3, NULL, NULL)
INSERT INTO "links" ("url", "completed", "size", "date_started", "date_finished", "package_id", "status_id") VALUES('rs.com/lost.s01.all.rar', NULL, NULL, NULL, NULL, 6, NULL)